src/InformationRegisters/Memory.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Memory</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипЗначенияПамяти</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Memory/Forms/ФормаЗаписи/Ext/Form/Module.bsl
//*****************************************************************************************
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Значение КАК Значение,
	|	Memory.Отладка КАК Отладка
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Запись.Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Попытка 
			
			ПредставлениеЗначения = Строка(Выборка.Значение.Получить());
			
		Исключение
			
		КонецПопытки; 
		
		Попытка 
			
			ПредставлениеОтладки = Строка(Выборка.Отладка.Получить());
			
		Исключение
			
		КонецПопытки; 
		
	КонецЕсли;
	
КонецПроцедуры
//*****************************************************************************************
&НаСервере
Процедура ЗначениеОтладкиПриИзмененииНаСервере()   
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Memory.Адрес КАК Адрес,
	|	Memory.Наименование КАК Наименование,
	|	Memory.Значение КАК Значение,
	|	Memory.Отладка КАК Отладка,
	|	Memory.Тип КАК Тип,
	|	Memory.Строка КАК Строка
	|ИЗ
	|	РегистрСведений.Memory КАК Memory
	|ГДЕ
	|	Memory.Адрес = &Адрес");
	
	Запрос.УстановитьПараметр("Адрес", Запись.Адрес);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		Memory = РегистрыСведений.Memory.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(Memory, Выборка);
		
		Memory.Отладка = Новый ХранилищеЗначения(ЗначениеОтладки);
		
		Memory.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры
//*****************************************************************************************
&НаКлиенте
Процедура ЗначениеОтладкиПриИзменении(Элемент) 
	
	ЗначениеОтладкиПриИзмененииНаСервере(); 
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры
//*****************************************************************************************
